Seo/LF_50/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// p/rho units m ^ 2 s^ - 1
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e5;

// The modified pressure is calculated adding the hydrostatic pressure p_rgh

boundaryField
{
    bottom
    {
        type            calculated;
        value           $internalField;
    }

    interphase
    {
        type            calculated;
        value           $internalField;
    }

    tank_wall
    {
        type            calculated;
        value           $internalField;
    }

    wedge0
    {
        type            wedge;
    }

    wedge1
    {
        type            wedge;
    }

}

// ************************************************************************* //
