Seo/LF_50/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

// Calculates the pressure
// based on the no slip boundary condition

boundaryField 
{
    bottom
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    interphase
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    tank_wall
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    wedge0
    {
        type            wedge;
    }

    wedge1
    {
        type            wedge;
    }

}

// ************************************************************************* //
