Seo/LF_50/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    bottom
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    interphase
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    tank_wall
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }

    wedge0
    {
        type            wedge;
    }

    wedge1
    {
        type            wedge;
    }

}


// ************************************************************************* //
