Seo/LF_50/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/CleanFunctions  # Tutorial clean functions

buoyantBoussinesqPvapFoam > buoy.log

#------------------------------------------------------------------------------
